import networkx as nx

# Створити граф
G = nx.Graph()

# Вершини (міста)
cities = [
    "Київ", "Рівне", "Луцьк", "Житомир", "Львів", "Харків", "Одеса", "Дніпро", "Запоріжжя",
    "Івано-Франківськ", "Тернопіль", "Кривий Ріг",
]
G.add_nodes_from(cities)

# Ребра з вагами (приблизні відстані в км)
edges = [
    ("Київ", "Львів", 540),
    ("Київ", "Харків", 480),
    ("Київ", "Одеса", 475),
    ("Київ", "Дніпро", 480),
    ("Київ", "Запоріжжя", 520),
    ("Київ", "Житомир", 140),
    ("Рівне", "Луцьк", 70),
    ("Рівне", "Тернопіль", 160),
    ("Рівне", "Львів", 210),
    ("Рівне", "Івано-Франківськ", 250),
    ("Рівне", "Київ", 340),
    ("Рівне", "Житомир", 200),
    ("Кривий Ріг", "Дніпро", 150),
    ("Кривий Ріг", "Запоріжжя", 220),
    ("Кривий Ріг", "Одеса", 300),
    ("Кривий Ріг", "Київ", 410),
    ("Житомир", "Рівне", 200),
    ("Житомир", "Луцьк", 220),
    ("Житомир", "Тернопіль", 250),
    ("Луцьк", "Львів", 150),
    ("Львів", "Івано-Франківськ", 130),
    ("Львів", "Тернопіль", 120),
    ("Тернопіль", "Івано-Франківськ", 105),
    ("Харків", "Дніпро", 210),
    ("Дніпро", "Запоріжжя", 85),
    ("Одеса", "Запоріжжя", 530)
]

# Додати ребра до графа з вагами
for city1, city2, distance in edges:
    G.add_edge(city1, city2, weight=distance)

