import networkx as nx
import matplotlib.pyplot as plt

# Створити граф
G = nx.Graph()

# Вершини (міста)
cities = [
    "Київ", "Рівне", "Луцьк", "Житомир", "Львів", "Харків", "Одеса", "Дніпро", "Запоріжжя",
    "Івано-Франківськ", "Тернопіль", "Кривий Ріг",
]

# Додати вершини до графа
G.add_nodes_from(cities)

# Ребра з вагами (приблизні відстані в км)
edges = [
    ("Київ", "Львів"),
    ("Київ", "Харків"),
    ("Київ", "Одеса"),
    ("Київ", "Дніпро"),
    ("Київ", "Запоріжжя"),
    ("Київ", "Житомир"),
    ("Рівне", "Луцьк"),
    ("Рівне", "Тернопіль"),
    ("Рівне", "Львів"),
    ("Рівне", "Івано-Франківськ"),
    ("Рівне", "Київ"),
    ("Рівне", "Житомир"),
    ("Кривий Ріг", "Дніпро"),
    ("Кривий Ріг", "Запоріжжя"),
    ("Кривий Ріг", "Одеса"),
    ("Кривий Ріг", "Київ"),
    ("Житомир", "Рівне"),
    ("Житомир", "Луцьк"),
    ("Житомир", "Тернопіль"),
    ("Луцьк", "Львів"),
    ("Львів", "Івано-Франківськ"),
    ("Львів", "Тернопіль"),
    ("Тернопіль", "Івано-Франківськ"),
    ("Харків", "Дніпро"),
    ("Дніпро", "Запоріжжя"),
    ("Одеса", "Запоріжжя")
]

# Додати ребра до графа
G.add_edges_from(edges)

# Обчислити та вивести кількість вершин, ребер та ступені вершин графа
print(f'Кількість вершин в графі: {G.number_of_nodes()}')
print(f'Кількість ребер в графі: {G.number_of_edges()}')
print('Ступені вершин графа:')
for city, degree in G.degree():
    print(f"{city}: {degree}")

# Візуалізувати граф
options = {
    "node_color": "yellow",
    "edge_color": "lightblue",
    "node_size": 500,
    "width": 3,
    "with_labels": True,
}
pos = nx.spring_layout(G, seed=12)
nx.draw(G, pos, **options)
plt.title("Граф міст України")
plt.show()