import networkx as nx

# Створити граф
G = nx.Graph()

# Вершини (міста)
cities = [
    "Київ", "Рівне", "Луцьк", "Житомир", "Львів", "Харків", "Одеса", "Дніпро", "Запоріжжя",
    "Івано-Франківськ", "Тернопіль", "Кривий Ріг",
]

# Додати вершини до графа
G.add_nodes_from(cities)

# Ребра з вагами (приблизні відстані в км)
edges = [
    ("Київ", "Львів"),
    ("Київ", "Харків"),
    ("Київ", "Одеса"),
    ("Київ", "Дніпро"),
    ("Київ", "Запоріжжя"),
    ("Київ", "Житомир"),
    ("Рівне", "Луцьк"),
    ("Рівне", "Тернопіль"),
    ("Рівне", "Львів"),
    ("Рівне", "Івано-Франківськ"),
    ("Рівне", "Київ"),
    ("Рівне", "Житомир"),
    ("Кривий Ріг", "Дніпро"),
    ("Кривий Ріг", "Запоріжжя"),
    ("Кривий Ріг", "Одеса"),
    ("Кривий Ріг", "Київ"),
    ("Житомир", "Рівне"),
    ("Житомир", "Луцьк"),
    ("Житомир", "Тернопіль"),
    ("Луцьк", "Львів"),
    ("Львів", "Івано-Франківськ"),
    ("Львів", "Тернопіль"),
    ("Тернопіль", "Івано-Франківськ"),
    ("Харків", "Дніпро"),
    ("Дніпро", "Запоріжжя"),
    ("Одеса", "Запоріжжя")
]

# Додати ребра до графа
G.add_edges_from(edges)


def dfs_recursive(graph, vertex, visited=None):
    if visited is None:
        visited = set()
    visited.add(vertex)
    print(vertex, end=' ')  # Відвідуємо вершину
    for neighbor in graph[vertex]:
        if neighbor not in visited:
            dfs_recursive(graph, neighbor, visited)

dfs_recursive(G, 'Рівне')